<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'المستخدمين والصلاحيات',
            'الأشخاص',
            'البيانات الأساسية',
            'المشتريات',
            'المبيعات',
            'المخازن',
            'المصروفات',
            'التقارير',

            'عرض المستخدمين',
            'إضافة المستخدمين',
            'تعديل المستخدمين',
            'حذف المستخدمين',

            'عرض الصلاحيات',
            'إضافة الصلاحيات',
            'تعديل الصلاحيات',
            'حذف الصلاحيات',

            'عرض العملاء',
            'إضافة العملاء',
            'تعديل العملاء',
            'حذف العملاء',
            'إستعادة العملاء',
            'طباعة العملاء',
            'أرشيف العملاء',

            'عرض الموردين',
            'إضافة الموردين',
            'تعديل الموردين',
            'حذف الموردين',
            'إستعادة الموردين',
            'طباعة الموردين',
            'أرشيف الموردين',

            'عرض الفئات',
            'إضافة الفئات',
            'تعديل الفئات',
            'حذف الفئات',
            'إستعادة الفئات',
            'طباعة الفئات',
            'أرشيف الفئات',

            'عرض الماركات',
            'إضافة الماركات',
            'تعديل الماركات',
            'حذف الماركات',
            'إستعادة الماركات',
            'طباعة الماركات',
            'أرشيف الماركات',

            'عرض العملات',
            'إضافة العملات',
            'تعديل العملات',
            'حذف العملات',
            'إستعادة العملات',
            'طباعة العملات',
            'أرشيف العملات',

            'عرض الوحدات',
            'إضافة الوحدات',
            'تعديل الوحدات',
            'حذف الوحدات',
            'إستعادة الوحدات',
            'طباعة الوحدات',
            'أرشيف الوحدات',

            'عرض المنتجات',
            'إضافة المنتجات',
            'تعديل المنتجات',
            'حذف المنتجات',
            'إستعادة المنتجات',
            'طباعة المنتجات',
            'أرشيف المنتجات',

            'عرض المشتريات',
            'إضافة المشتريات',
            'حذف المشتريات',
            'طباعة المشتريات',
            'عرض دفع المشتريات',
            'إضافة دفع المشتريات',
            'تعديل دفع المشتريات',
            'حذف دفع المشتريات',

            'عرض مرتجع المشتريات',
            'إضافة مرتجع المشتريات',
            'حذف مرتجع المشتريات',
            'طباعة مرتجع المشتريات',
            'عرض دفع مرتجع المشتريات',
            'إضافة دفع مرتجع المشتريات',
            'تعديل دفع مرتجع المشتريات',
            'حذف دفع مرتجع المشتريات',

            'عرض المبيعات',
            'إضافة المبيعات',
            'حذف المبيعات',
            'طباعة المبيعات',
            'عرض دفع المبيعات',
            'إضافة دفع المبيعات',
            'تعديل دفع المبيعات',
            'حذف دفع المبيعات',

            'عرض مرتجع المبيعات',
            'إضافة مرتجع المبيعات',
            'حذف مرتجع المبيعات',
            'طباعة مرتجع المبيعات',
            'عرض دفع مرتجع المبيعات',
            'إضافة دفع مرتجع المبيعات',
            'تعديل دفع مرتجع المبيعات',
            'حذف دفع مرتجع المبيعات',

            'عرض المخازن',
            'إضافة المخازن',
            'تعديل المخازن',
            'حذف المخازن',
            'إستعادة المخازن',
            'طباعة المخازن',
            'أرشيف المخازن',

            'عرض المخزون',
            'طباعة المخزون',

            'عرض تعديل المخزون',
            'إضافة تعديل المخزون',
            'حذف تعديل المخزون',
            'طباعة تعديل المخزون',

            'عرض فئات المصروفات',
            'إضافة فئات المصروفات',
            'تعديل فئات المصروفات',
            'حذف فئات المصروفات',
            'إستعادة فئات المصروفات',
            'طباعة فئات المصروفات',
            'أرشيف فئات المصروفات',

            'عرض المصروفات',
            'إضافة المصروفات',
            'تعديل المصروفات',
            'حذف المصروفات',
            'إستعادة المصروفات',
            'طباعة المصروفات',
            'أرشيف المصروفات',

            'عرض تقرير المدفوعات',
            'عرض تقرير مدفوعات المشتريات',
            'عرض تقرير مدفوعات المبيعات',
            'عرض تقرير مدفوعات مرتجع المشتريات',
            'عرض تقرير مدفوعات مرتجع المبيعات',
            'عرض تقرير المخازن',
            'عرض تقرير المبيعات',
            'عرض تقرير المشتريات',
            'عرض تقرير العملاء',
            'عرض تقرير الموردين',
            'عرض تقرير تنبيه المخزون',
            'عرض تقرير الإحصائيات',

            'الإشعارات',
        ];



        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }
    }
}
